Revit 2027 API
NumberingSchema.CanChangePartitioningValue Method
 Returns true if this schema has partitions based on one parameter, that parameter is of type Text and it is modifiable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanChangePartitioningValue()
Public Function CanChangePartitioningValue As Boolean
public:
bool CanChangePartitioningValue()
member CanChangePartitioningValue : unit -> bool
Return Value
Boolean
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace